Repository: rburda82/proxysearcher
Catalog: ProxySearch.Application/Properties/Resources.*.resx
Languages: de, ru, uk

# OldConfigurationException
source: It looks like configuration of Proxy Searcher is not up-to-date. In order to fix that error open Tools->Settings and press 'Restore defaults' button on General tab.
de: Es sieht aus wie Konfiguration des Proxy Searcher ist nicht auf dem neuesten Stand. Um diesen Fehler zu beheben, öffnen Sie Werkzeuge->Einstellungen, und drücken Sie die Taste "Standardeinstellungen wiederherstellen" auf der Registerkarte Allgemein.
ru: Конфигурация Proxy Searcher выглядит устаревшей. Для того чтобы исправить эту проблему откройте Инструменты->Настройки и нажмите кнопку 'Настройки по умолчанию' на закладке 'Основные'.
uk: Конфігурація Proxy Searcher виглядає застарілою. Для того щоб виправити цю проблему відкрийте Інструменти->Налаштування і натисніть кнопку 'Налаштування по замовчуванню' на закладці 'Основні'.

# NameOfCountryWasDeterminedBasedOnOutgoingAddress
source: Name of country was determined based on outgoing IP address '{0}' which is different from ingoing IP address '{1}'.
de: Name des Landes wurde ermittelt auf Basis ausgehende IP-Adresse '{0}' die sich von eingehenden IP-Adresse ist '{1}'.
ru: Страна определилась по исходящему адресу прокси '{0}', который отличается от входящего адреса '{1}'.
uk: Країна визначалася за вихідною адресої проксі '{0}', яка відрізняється від вхідної адреси '{1}'.

# IPAddressDescriptionFormat
source: Incoming IP address: {0} Outgoing IP address: {1}
de: Eingehende IP-Adresse {0} Ausgehende IP-Adresse: {1}
ru: Входящий адрес: {0} Исходящий адрес: {1}
uk: Вхідна адреса: {0} Вихідна адреса: {1}

source: Undetermined
de: Unbestimmt
ru: Не определён
uk: Не визначена

source: Manual update proxy type
de: Manuelles Update Proxytyp
ru: Ручное определение типа прокси
uk: Визначення типу проксі вручну

source: Chrome
ru: Хром
uk: Хром

# SimpleProxyChecker
source: By IP:Port
ru: По адресу и порту
uk: За адресою і портом

source: Information
ru: Информация
uk: Інформация

source: <all sites>
ru: <все сайты>
uk: <всі сайти>

# FeedbackLink
source: https://sourceforge.net/p/proxysearcher/discussion/yourfeedback/
ru: https://sourceforge.net/p/proxysearcher/discussion/yourfeedbackru/
uk: https://sourceforge.net/p/proxysearcher/discussion/yourfeedbackua/

source: Firefox
ru: Файрфокс
uk: Файрфокс

source: Internet explorer
ru: Интернет експлорер
uk: Інтернет експлорер

source: Opera
ru: Опера
uk: Опера

source: Parallel
ru: Паралельный
uk: Паралельний

# AndMoreFormat
source: ... and on {0} more
ru: ... и еще на {0} больше
uk: ... і ще на {0} більше
