Repository: rburda82/proxysearcher
Catalog: ProxySearch.Application/Properties/Resources.*.resx
Languages: de, ru, uk

# AllSettingsWillBeRevertedToTheirDefaults
source: All settings will be reverted to their defaults. Do you want to continue?
de: Alle Einstellungen werden auf die Standardwerte zurückgesetzt. Wollen Sie weitermachen?
ru: Все текущие установки будут заменены установками по умолчанию. Вы хотите продолжить?
uk: Всі поточні налаштування будуть замінені налаштування по замовчуванню. Ви хочете продовжити?

# BuiltInGeoIPDescription
source: Built in Geo IP, This option is good choice, but GeoIP data could be not latest and searching take some processor time
de: In GeoIP erbaut, ist diese Option eine gute Wahl, aber GeoIP Daten konnten nicht neusten und Such nehmen Sie sich etwas Prozessorzeit
ru: Встроенное определение страны. Эта опция хороша быстротой работы, но эти данные могут быть не самыми новыми и определение страны занимает относительно много процесорного времени.
uk: Вбудоване визначення країни. Ця опція відрізняється швидкодією. При цьому дані можуть бути застарілими, а визначення країни займає відносно багато процесорного часу.

# BuiltInGeoIPName
source: Built in
de: Eingebaut
ru: Встроенное
uk: Вбудоване

source: Cancel
de: Stornieren
ru: Отменить
uk: Відмінити

source: Cancelling
de: Stornierung
ru: Отменяю
uk: Відміняю

# CannotFindInstallationUrl
source: Cannot find installation url of Proxy Searcher
de: Kann die Installation url von Proxy Searcher nicht gefunden
ru: Невозможно найти исталляционный адрес программы.
uk: Неможливо відкрити інсталяційну адресу програми.

# CannotUpdateProgram
source: Cannot update program. Do you want to do it manually?
de: Kann Programm nicht aktualisiert werden. Wollen Sie es manuell zu tun?
ru: Невозможно обновить программу. Вы хотите сделать это вручную?
uk: Неможливо обновити програму. Ви хочете зробити це самостійно?

# DefaultTabName
source: Custom search
de: Eigene Suche
ru: Свой поиск
uk: Свій пошук

source: Details
de: Einzelheiten
ru: Детали
uk: Деталі

# DonateLink
source: http://proxysearcher.sourceforge.net/donate.html
de: http://sourceforge.net/donate/?user_id=1813459

source: Do you really want to clear proxy usage history?
de: Wollen Sie wirklich, um Nutzungsverlauf der Proxy löschen?
ru: Вы на самом деле хотите очистить историю использования прокси?
uk: Ви насправді хочете очистити історію використання проксі?

# DoYouWantToRestartBrowser
source: Browser '{0}' should be restarted in order to set or clear proxy. Do you want to do it now?
de: Browser '{0}' sollte, um einzustellen oder zu löschen Proxy neu gestartet werden. Möchten Sie es jetzt tun?
ru: Браузер '{0}' нужно перегрузить для того, чтобы установить или очистить прокси. Вы хотите сделать это сейчас
uk: Браузер '{0}' потрібно перезавантажити для того, щоб встановити або очистити проксі. Ви хочете зробити це зараз?

# DummyGeoIP
source: Turn off
de: Ausschalten
ru: Выключить
uk: Вимкнути

# DummyGeoIPDescription
source: Turns off Geo IP. It is faster if compare with other options, but it will not give you proxy location
de: Schaltet Geo IP. Es ist schneller, wenn mit anderen Optionen zu vergleichen, aber es wird nicht geben Ihnen Proxy Standort
ru: Выключает определение страны. Этот метод работает быстрее если сравнивать с другими методами, но страна найденных прокси не будет установлена.
uk: Вимикає визначення країни. Цей метод працює швидше в порівнянні з іншими методами, але країни знайдених проксі не будуть визначені.

source: Error
de: Fehler
ru: Ошибка
uk: Помилка

source: Error has happened during test
de: Fehler bei der Prüfung passiert
ru: Произошла ошибка при тестировании
uk: При тестуванні сталася помилка

# FoundProxiesFormat
source: Found {0} and shown {1} proxies.
de: Gefunden {0} und {1} dargestellt Proxies.
ru: Найдено {0} и показано {1} прокси серверов.
uk: Найдено {0} і показано {1} проксі серверів.

# GoogleEngineDescription
source: Uses http://google.com site for proxy searching. If you cannot open http://google.com from browser then use other type of search engine
de: Verwendet http://google.com Website für Proxy-Suche. Wenn Sie sich nicht http://google.com von Browser zu öffnen Sie dann mit andere Art von Suchmaschine
ru: Использует http://google.com сайт для поиска прокси. Если Вы не можете открыть http://google.com в браузере тогда используйте другой тип поиска.
uk: Використовує http://google.com сайт для пошуку проксі. Якщо Ви не можете відкрити http://google.com в браузері тоді використайте інший тип пошуку.

source: Grid has no sorting
de: Gitter hat keine Sortierung

# JobCountFormat
source: Job Count {0}
de: Job Anzahl {0}
ru: Количество задач {0}
uk: Кількість задач {0}

# ProxyCheckerByUrl
source: By Url
de: Mit URL
ru: По адресу
uk: За адресою

# ProxyCheckerByUrlAndKeywords
source: By Url And Keywords
de: Durch die URL und Schlüsselwörter
ru: По адресу и ключевым словам
uk: За адресою і ключовими словами

# ProxyCheckerByUrlAndKeywordsDescription
source: This proxy checker could be useful if you don't have access to http page, but know his url and list of keywords what should be on page. This method is slower if compare with checker by IP:Port, but it filters better. If this checker don't return any results try to change keywords, probably page doesn't contains them. All specified keywords separates with space, all of them should be on the page, as keyword could be specified piece of http code without space(s). Because of content downloading this checker takes internet traffic.
de: Diese Proxy-checker könnte nützlich sein, wenn Sie nicht über Zugriff auf http-Seite, aber wissen, seine URL und Keyword-Liste, was auf Seite sein. Diese Methode ist langsamer, wenn mit Prüfung von IP zu vergleichen: Port, aber es filtert besser. Wenn dies checker nicht zurück irgendwelche Ergebnisse versuchen, Schlüsselwörter zu ändern, vielleicht Seite ist enthält sie nicht. Alle bestimmte Schlüsselwörter durch Leerzeichen getrennt ein, alle von ihnen sollten auf der Seite sein, wie Keyword könnte angegebenen Stück http Code werden ohne Leerzeichen (e). Durch das Herunterladen von Inhalten dieser Überprüfung dauert Internet-Verkehr.
ru: Этот метод проверки может быть полезным если у вас нет доступа к http странице, но вы знаете её адрес и список ключевых слов которые присутствуют на ней. Этот метод медленее в сравнении с проверкой по адресу и порту но работает лучше. Если этот метод ничего не возвращает тогда попробуйте поменять ключевые слова (возможно страница не содержит их). Все ключевые слова должны быть разделены пробелом и должны присутсвовать на странице, В качестве ключевого слова можно указывать часть html кода без пробелов. Из-за скачивания контента страницы этот способ использует интернет траффик.
uk: Цей метод перевірки може бути корисним якщо у Вас немає доступа до http сторінки, але Ви знаєте її адресу і список ключових слів які на ній присутні. Цей метод повільніший в порівнянні з методом перевірки за адресою і портом, але працює краще. Якщо метод нічого не повертає спробуйте змінити ключові слова (можливо сторінка їх не містить). Всі ключові слова повинні бути розділеними пробілами і повинні бути присутніми на сторінці. В якості ключового слова можна вказувати частину html кода без пробілів. Через скачування вмісту сторінки цей спосіб використовує інтернет трафік.

# ProxyCheckerByUrlDescription
source: This proxy checker downloads content of specified url with and without proxy. If contents are similar then proxy is valid and will be returned by checker. This method is slower comparing with checker by IP:Port, but it filters better. If this checker doesn't return any results, try to change accuracy, probably page's content is too dynamic. Because of downloading page, content this checker takes internet traffic.
de: Dies Proxy checker-Downloads Inhalt der angegebenen URL mit und ohne Proxy. Wenn Inhalte ähneln dann Proxy ist gültig und wird von checker zurückgegeben werden. Diese Methode ist langsamer verglichen mit checker von IP: Port, aber es filtert besser. Wenn dies checker hat kein Ergebnis, versuchen Sie, um die Genauigkeit zu ändern, vielleicht auf einer Seite Gehalt zu dynamischen. Aufgrund der Download-Seite, nimmt diese Inhalte checker Internet-Verkehr.
ru: Этот метод проверки скачивает содержимое указанного адреса сначала без прокси, а потом вместе с ним. Если содержание контента приблизительно одинаковое тогда прокси считается рабочим. Этот метод медленее в сравнении с проверкой по адресу и порту но работает лучше. Если этот метод ничего не возвращает тогда попробуйте уменьшить точность, возможно содержание страницы слишком динамичное. Из-за скачивания контента страницы этот способ использует интернет траффик.
uk: Цей метод перевірки скачує вміст вказаного адресу спочатку без проксі, а потім разм з ним. Якщо вміст приблизно однаковий тоді проксі вважається робочим. Цей метод повільніший в порівнянні з методом перевірки за адресою і портом, але працює краще. Якщо метод нічого не повертає то спробуйте зменшити точність - можливо вміст сторінки занадто динамічний. Через скачування вмісту сторінки цей спосіб використовує інтернет трафік.

source: Question
de: Frage
ru: Вопрос
uk: Питання

source: Ready
de: Bereit
ru: Ожидание
uk: Очікування

source: Search is cancelled on user request
de: Suche auf Benutzeranforderung annulliert ist
ru: Поиск отменен на запрос пользователя
uk: Пошук відмінено на запит користувача

# SearchIsFinishedProxiesWasFound
source: Search is finished. {0} proxies was found
de: Suche beendet ist. {0} Proxies wurde festgestellt,
ru: Поиск закончен. {0} прокси было найдено
uk: Пошук закінчено. {0} проксі було знайдено

# SearchIsFinishedProxiesWasNotFound
source: Search is finished. No proxy was found. Change search query and try again
de: Suche beendet ist. Kein Proxy gefunden wurde. Ändern Sie Suchkriterien und versuchen es noch einmal
ru: Поиск закончен. Ничего не найдено . Поменяйте условия поиска и попробуйте снова.
uk: Пошук закінчено. Нічого не знайдено. Змініть умови пошуку і спробуйте знову.

# SimpleProxyCheckerDescription
source: This simple checker sees if ip address of candidate is alive and port is opened. Can be used for any proxy type searching. It is fast because it don't require any external services. It cannot check if candidate is workable proxy, therefore it would return unworkable proxies.
de: Diese einfache Checker sieht, wenn IP-Adresse des Kandidaten ist lebendig und Port geöffnet. Es kann für jeden Proxy-Typ Suche verwendet werden. Es ist schnell, weil es keine externe Dienste benötigen. Es kann nicht überprüfen, ob Kandidaten praktikabel Proxy, daher wäre es nicht praktikabel Proxies zurück.
ru: Этот метод проверки смотрит или интернет адрес и порт открыт для использования. Может использоваться для проверки любых типов прокси. Он быстрый потому что не использует внешних сервисов. Но метод не может проверить или кандидат является рабочим прокси сервером поэтому он может вернуть не рабочие прокси.
uk: Цей метод перевірки дивиться чи інтернет адреса і порт відкриті для використання. Може використовуватися для перевірки будь-яких типів проксі. Він швидкий тому що не використовує додаткових сервісів. Але метод не може перевірити чи кандидат є робочим проксі тому часто повертає неробочі проксі.

# SortTypeIsNotSupported
source: Sort type by '{0}' is not supported
de: Sortieren nach Typ '{0}' wird nicht unterstützt
ru: Сортировка по '{0}' не поддерживается
uk: Сортування по '{0}' не піддтримується

# SpeedRespondTooltipFormat
source: Speed: {1} Mb/s Response time: {0} s
de: Geschwindigkeit: {1} Mb/s Reaktionszeit: {0} s
ru: Скорость: {1} Мб/с Время отклика: {0} с
uk: Швидкість: {1} Мб/с Час відгуку: {0} с

source: Uninstalling
de: Deinstallieren

# UpdateIsReadyToInstall
source: New version of Proxy Searcher is available. Do you want to get it now?
de: Neue Version von Proxy Searcher verfügbar ist. Möchten Sie es jetzt zu bekommen?
ru: Выпущенная более новая версия программы. Хотите установать ее сейчас?
uk: Опублікована більш нова версія програми. Хочете встановити її зараз?

source: Wait until current operation is finished
de: Warten Sie, bis laufende Vorgang abgeschlossen ist
ru: Подождите окончания текущего действия
uk: Зачекайте закінчення поточної дії

# WebServiceNetGeoIPServiceDescription
source: Uses http://www.webservicex.net/geoipservice.asmx service as Geo IP. If you cannot open http://www.webservicex.net/geoipservice.asmx from browser, use other type of Geo IP
de: Verwendet http://www.webservicex.net/geoipservice.asmx Service als Geo-IP. Wenn Sie sich nicht http://www.webservicex.net/geoipservice.asmx von Browser zu öffnen, verwenden Sie eine andere Art von Geo-IP
ru: Использует http://www.webservicex.net/geoipservice.asmx сервис для определения страны в которой находится прокси. Если адрес http://www.webservicex.net/geoipservice.asmx не открывается в браузере тогда используйте другой тип определения страны
uk: Використовує http://www.webservicex.net/geoipservice.asmx сервіс для визначення країни в якій знаходиться проксі. Якщо адреса http://www.webservicex.net/geoipservice.asmx не відкривається в браузері тоді використовуйте інший тип визначення країни

source: You should clear value before set new one
de: Sie sollten Wert zu löschen, bevor setzen Sie die neue

# FolderSearchEngine
source: Search in folder
de: Suche im Verzeichnis
ru: По файлам в папке
uk: По файлам в папці

# FolderSearchEngineDescription
source: If you have folder what contains files with proxies inside in the format [ip]:[port] you could select this search engine. Unfortunately it cannot discover new proxies, but it will check if proxies from files in selected folder are workable. This search engine will work fine together with export feature.
de: Wenn Sie den Ordner, was enthält Dateien mit Proxies innen im Format [IP]: [Anschluss] Sie diese Suchmaschine zu wählen konnte. Leider kann sie nicht entdecken Sie neue Vollmachten, aber sie wird überprüfen, ob Stimmrechtsvollmachten von Dateien im ausgewählten Ordner sind bearbeitbar. Diese Suchmaschine wird gut zusammen mit Export-Funktion arbeiten.
ru: Если у вас есть папка которая содержит файлы с прокси внутри в формате [ip]:[port] Вы можете выбрать этот способ поиска. К сожалению он не может найти новые прокси, но он проверит или прокси в файлах рабочие для текущего сегмента сети. Этот способ поиска хорошо работает вместе с вкюченный експортированием найденный прокси.
uk: Якщо у Вас є папка яка містить файли з проксі в потрібному форматі Ви можете вибрати цей спосіб пошуку. На жаль він не може знайти нові проксі, але метод перевірить чи є робочими проксі в файлах для поточного сегменту мережі. Цей спосіб добре працює разом з включеним експортуванням знайдених проксі.

# UrlListEngine
source: By Url List
de: Mit URL-Liste
ru: По списку ссылок
uk: За списком посилань

# UrlListEngineDescription
source: If you have list of urls what contains text with proxies in the format [ip]:[port] you could select this search engine. Unfortunately it cannot discover new sources of proxies, but it will be able to find new proxies if they appear on page.
de: Wenn Sie eine Liste von URL, die Text mit Proxies im Format [IP]: [Anschluss] enthält haben: konnte Sie diese Suchmaschine zu wählen. Leider kann es neue Quellen von Proxies nicht entdecken, aber es ist in der Lage, neue Proxies zu finden, wenn sie auf Seite erscheinen.
ru: Этот метод проверки использует список ссылок содержащих прокси сервера в формате [адрес]:[порт]. К сожалению он не находит новых источников прокси но может найти новые прокси если они появлятся на указанных страницах.
uk: Цей метод перевірки використовує список посилань які містять проксі сервера в форматі [адреса]:[порт]. На жаль він не знаходить нових джерел проксі, але може знайти нові проксі якщо вони з'являються на вказаних сторінках.

source: Do you really want to clear blacklist?
de: Wollen Sie wirklich, um schwarze Liste zu löschen?
ru: Вы на самом деле хотите очистить чёрный список?
uk: Ви насправді хочете очистити чорний список?

# HttpOpen
source: Open findings as HTTP
de: Öffnen Ergebnisse wie HTTP
ru: Открыть найденные HTTP прокси
uk: Відкрити знайдені HTTP проксі

# TurnedOffProxyChecker
source: Check manually after search
de: Überprüfen Sie manuell, nachdem Suche
ru: Проверить вручную после поиска
uk: Перевірити вручну після пошуку

# TurnedOffProxyCheckerDetails
source: This proxy checker type retrieves all proxies without filtering. It could be useful of opening results from previous searches.
de: Diese Proxy-checker Typ ruft alle Proxies ohne Filterung. Es könnte nützlich öffnen Ergebnisse von früheren Suchanfragen sein.
ru: Этот метод проверки возвращает все прокси без проверки. Как правило используется для открытия результатов предыдущих поисков.
uk: Цей метод повертає всі проксі без перевірки. Як правило використовується для відкриття результатів попередніх пошуків.

# HttpPredefinedUrlList
source: HTTP (list of urls)
de: HTTP (Liste von URLs)
ru: HTTP (список ссылок)
uk: HTTP (список посилань)

source: You cannot delete last search settings.
de: Sie können die letzten Sucheinstellungen nicht gelöscht werden.
ru: Нельзя удалить единственный критерий поиска.
uk: Не можна знащати останній критерій пошуку

# HttpProxyTypeDescription
source: This type allows to find http proxies
de: Diese Art erlaubt HTTP Proxies zu finden
ru: Этот тип разрешает найти HTTP прокси
uk: Цей тип дозволяє знайти HTTP проксі

# SocksProxyTypeDesciption
source: This type allows to find socks proxies
de: Diese Art erlaub Socks Proxies zu finden
ru: Этот тип разрешает найти SOCKS прокси
uk: Цей тип дозволяє знайти SOCKS проксі

# CannotSetProxyForFirefoxWhenSocksVersionIsNotDefined
source: Cannot set sock proxy for Firefox when socks version is not defined
de: Kann SOCKS-Proxy für Firefox nicht einstellen, wenn Socken-Version ist nicht definiert
ru: Невозможно установить SOCKS прокси для FireFox если версия SOCKS не была определена
uk: Неможливо встановити SOCKS проксі для FireFox якщо версія SOCKS не була аизначена

# ThisClientDoesntSupportSocks5Proxies
source: This client doesn't support socks v5 proxies
de: Dieser Client unterstützt keine Socks v5 Proxies
ru: Этот клиент не поддерживает socks 5-й версии
uk: Цей кліент не підтримує socks 5-ї версії

# TypeOfProxyIsNotDefinedDoYouWantToContinue
source: Type of proxy is not defined and this client doesn't support socks v5 proxies, so socks v5 will not work if you set proxy. Do you want to continue?
de: Art der Proxy nicht definiert ist und dieser Client unterstützt keine Socks v5 Proxies, so Socks v5 wird nicht funktionieren, wenn Sie Proxy gesetzt. Wollen Sie weitermachen?
ru: Тип прокси неопределенный. Этот клиент не поддерживает socks 5-й версии, поэтому socks 5-й версии не будет работать с этим клиентом. Продолжить?
uk: Тип проксі невизначений. Цей клієнт не підтримує socks 5-ї версиї, через це socks 5-ї версії не буде працювати з цим клієнтом. Продовжити?

# SocksOpen
source: Open findings as Socks
de: Öffnen Ergebnisse wie Socks
ru: Открыть найденные SOCKS прокси
uk: Відкрити знайдені SOCKS проксі

# SocksPredefinedUrlList
source: Socks (list of urls)
de: Socks (Liste von URLs)
ru: Socks (список ссылок)
uk: Socks (список посилань)

# GoogleDetectsSendingOfAutomaticQueries
source: Google detects that your network sends automatic queries therefore this search type won't work at this moment. You could use search by list of urls which is not using google engine or try again later.
de: Google erkennt, dass Ihr Netzwerk sendet automatische Anfragen daher diese Suchart nicht in diesem Moment arbeiten. Sie können Suche nach Liste von URLs, die nicht mit ist google Motor oder versuchen Sie es später erneut zu verwenden.
ru: Google опередил что Ваша сеть отсылает автоматические запросы, поэтому этот тип поиска не будет работать в этот момент времени. Вы можете использовать другие методы поиска которые не используют Google или попробовать попозже.
uk: Google визначив що Ваша мережа відправляє автоматичні запити, тому цей тип пошуку працювати не буде в даний момент часу. Ви можете використати інші методи пошуку які не використовують Google або спробувати пізніше.

source: Closed
de: Geschlossen

source: Started
de: Schritte

source: Search
de: Suche
ru: Поиск
uk: Пошук

source: Search cancelled
de: Suche abgesagt
ru: Поиск отменён
uk: Пошук відмінено

source: Search finished
de: Suche beendet
ru: Поиск закончен
uk: Пошук закінчений

source: Search started
de: Suche gestartet
ru: Поиск начат.
uk: Пошук почато.

source: Installed
de: Installierte

# ShareCheckBox
source: ShareStatistic
de: Teilen Statistik

# FoundAndShownProxiesFormat
source: Found and shown {0} proxies.
de: Gefunden und angezeigt {0} Proxies.
ru: Найдено и показано {0} прокси серверов.
uk: Знайдено і показано {0} проксі серверів.

source: Do you really want to delete this parse method?
de: Wollen Sie wirklich, diese Parse-Methode löschen?
ru: Вы на самом деле хотите удалить этот метод разбора текста
uk: Ви насправді хочете знищити вибраний метод розбору тексту?

source: Test url doesn't match defined url
de: Test-URL nicht definiert url entsprechen
ru: Тестовый адрес не содержит исходного адреса
uk: Тестова адреса не містить вихідної адреси

# NoOneProxyHasBeenFound
source: No proxy has been found
de: Kein Proxy wurde festgestellt
ru: Прокси не были найдены
uk: Проксі не були знайдені

source: Advertising closed
de: Werbung geschlossen

source: Advertising opened in browser
de: Werbung eröffnete im Browser

source: Search initialization
de: Suche nach der Initialisierung
ru: Инициализация поиска
uk: Ініціалізація пошуку

# PreparingApplication
source: Preparing search application
de: Vorbereiten Suchanwendung
ru: Настраивается приложение поиска
uk: Налаштовується додаток пошуку

source: Preparing geo ip service
de: Vorbereitung geo ip Service
ru: Настраивается сервис определения страны
uk: Налаштовується сервіс визначення країни

source: Preparing proxy checker
de: Vorbereitung Proxy checker
ru: Настраивается метод проверки прокси
uk: Налаштовується метод перевірки проксі

source: Preparing proxy provider
de: Vorbereitung Proxy-Provider
ru: Настраивается поставщик прокси
uk: Налаштовуєтьсяпоставщик проксі

source: Reading configuration of selected search
de: Lesen Konfiguration der ausgewählten Such
ru: Читается конфигурация выбранного метода поиска
uk: Читається конфігурація вибраного методу пошуку

# ParallelDescription
source: This search engine allows to combine a few other engines in one search criteria and run them simultaneously. Use it if you want to get benefits from a few different search engines in one search criteria.
de: Diese Suchmaschine erlaubt es, ein paar andere Maschinen in einer Suchkriterien kombinieren und gleichzeitig laufen sie. Verwenden Sie es, wenn Sie profitiert von ein paar verschiedenen Suchmaschinen in einer Suchkriterien wollen.
ru: Этот метод поиска позволяет комбинировать несколько других методов в одном критерии поиска и исполнять их одновременно. Используйте его если Вы хотите получить преимущества нескольких методов поиска в одном поисковом критерии.
uk: Цей метод пошуку дозволяє комбінувати кілька інших методів в одному критерію пошуку і виконувати їх одночасно. Використовуйте його якщо Ви хочете отримати переваги декількох методів пошуку в одному пошуковому критерії.
