Repository: rburda82/proxysearcher
Catalog: ProxySearch.Engine/Properties/Resources.*.resx
Languages: de, ru, uk

source: Anonymous
ru: Анонимный
uk: Анонімний

# AnonymousDetails
source: This proxy type hides your ip, but proxy usage could be detected easily. Never transfer secure data with public proxy.
de: Diese Proxy-Typ verbirgt Ihre IP, aber Proxynutzung könnte leicht erkannt werden. Nie transfer sichere Daten mit öffentlichen Proxy.
ru: Этот тип прокси прячет ваш адрес но использование прокси может быть легко определено. Никогда не передевайте личные данные через публичные прокси.
uk: Цей тип проксі ховає вашу адресу але використання проксі може бути легко визначено. Ніколи не передевайте особисті дані через публічні проксі.

# CannotDownloadContent
source: Cannot download content of '{0}'. Probably you don't have internet connection or '{0}' is blocked for your network. If it's blocked then go to Tools->Properties and change proxy checker 'By Url' to 'By Url and Keywords' (this checked type is especially for blocked sites).
de: Kann nicht heruntergeladen Inhalt '{0}'. Wahrscheinlich haben Sie nicht über Internet-Verbindung oder '{0}' ist für das Netzwerk blockiert. Wenn es blockiert dann Tools->Properties gehen und ändern Proxy checker 'Durch die URL' auf 'Durch URL und Keywords' (diese überprüft Typ ist besonders für blockierte Seiten).
ru: Невозможно скачать содержимое страницы '{0}'. Возможно у вас нет интернет соеденения или страница '{0}' заблокирована в вашей сети. Если страница заблокирована тогда откройте Инструменты->Настройки и измените метод проверки 'По адресу' на 'По адресу и ключевым словам' (этот метод проверки специально предназначен для заблокированных сайтов).
uk: Неможливо скачати вміст сторінки '{0}'. Можливо у Вас немає інтернет з'єдання або сторінка '{0}' заблокована в Вашій мережі. Якщо сторінка заблокована тоді відкрийте Інструменти->Налаштування і змініть метод перевірки 'За адресою' на 'За адресою і ключовими словами' (цей метод перевірки спеціально призначений для роботи з заблокованими сайтами).

source: Cannot verify
de: Kann nicht überprüft
ru: Не определен
uk: Не визначений

# CannotVerifyDetails
source: Unfortunately we cannot detect type of this proxy. Probably it is offline or blocks our test service. You still able to use this proxy on your own risk. Never transfer secure data with public proxy.
de: Wir können leider Typ dieser Proxy nicht erkennt. Wahrscheinlich ist es offline oder Blöcke unserem Test-Service. Sie sind noch in der Lage, diese Vollmacht auf eigene Gefahr. Nie transfer sichere Daten mit öffentlichen Proxy.
ru: К сожалению определить тип прокси невозможно. Возможно он не работает в данный момент или блокирует наш тестовый сервис. Тем не менее данный прокси можно использовать. Никогда не передевайте личные данные через публичные прокси.
uk: На жаль визначити тип проксі в даний момент неможливо. Можливо він не працює в даний момент часу або блоку наш тестовий сервіс. Тим не менше даний проксі можна використовувати. Ніколи не передевайте особисті дані через публічні проксі.

source: Changes content
de: Änderungen Inhalt
ru: Меняет содержимое
uk: Змінює вміст

# ChangesContentDetails
source: During detection type of this proxy downloaded content was changed. Most of all this proxy cannot be used free, it could infect your PC with viruses or provide some commercial. Try to avoid usage proxy of this type. Never transfer secure data with public proxy.
de: Während der Erkennung Typ dieser Proxy heruntergeladen Inhalt wurde geändert. Vor allem dieser Proxy kann nicht frei verwendet werden, es könnte Ihr PC mit Viren zu infizieren oder einen gewissen Handels. Versuchen Sie, die Nutzung Proxy dieser Art zu vermeiden. Nie transfer sichere Daten mit öffentlichen Proxy.
ru: Во время определения типа прокси скачанное содержимое отличается от ожидаемого. Возможно этот прокси платный, содержит вирусы или предлагает рекламу. Постарайтесь не использовать прокси этого типа. Никогда не передевайте личные данные через публичные прокси.
uk: Під час визначення типу проксі скачаний вміст відрізняється від очікуваного. Можливо цей проксі платний, містить віруси або пропонує рекламу. Постарайтеся не використовувати проксі цього типу. Ніколи не передевайте особисті дані через публічні проксі.

# CheckingProxiesFormat
source: Checking proxies: {0}
de: Überprüfen Proxies: {0}
ru: Проверяемые прокси: {0}
uk: Перевіряються проксі: {0}

source: Checking proxy if it works
de: Überprüfen ob Proxy funktioniert
ru: Проверяется работоспособность прокси
uk: Визначається працездатність проксі

source: Configure provider of proxy details
de: Konfigurieren Anbieter von Proxy-Details
ru: Настройка поставщика деталей прокси
uk: Налаштовується постачальник деталей проксі

source: Configuring proxy checker
de: Konfigurieren der Proxy-checker
ru: Настраивается метод проверки прокси
uk: Налаштовується метод перевірки проксі

source: Determine current IP address
de: Ermitteln Sie die aktuelle IP-Adresse
ru: Определяется текущий IP адрес
uk: Визначається поточна IP адреса

# DownloadingFormat
source: Downloading '{0}'.
de: Herunterladen von '{0}'.
ru: Скачивается '{0}'
uk: Завантажується '{0}'

source: High Anonymous
de: Hohe Anonymous
ru: Элитный
uk: Елітний

# HighAnonymousDetails
source: This proxy type hides your ip and proxy usage cannot be detected easily. Some methods could detect proxy usage, but they dont give 100% guarantee that proxy usage will be detected. It is safest type of public proxy. Never transfer secure data with public proxy.
de: Diese Proxy-Typ verbirgt Ihre IP und Proxy-Nutzung nicht leicht erkannt werden. Some methods could detect proxy usage, Einige Methoden konnte Proxy Nutzung erkennen, aber sie geben nicht 100% Garantie dass Proxy-Nutzung werden erkannt. Es ist am sichersten Art von öffentlichen Proxy. Nie transfer sichere Daten mit öffentlichen Proxy.
ru: Этот тип прокси прячет ваш адрес и использование прокси не может быль легко установлено. Некоторые методы могут определить использование прокси но они не дают 100% гарантии правильности определения. Это наилучший тип публичного прокси. Никогда не передевайте личные данные через публичные прокси.
uk: Цей тип проксі ховає Вашу інтернет адресу і використання проксі не може бути легко встановлено. Деякі методи можуть визначити використання проксі, але вони не дають 100% гарантіх правильності визначення. Це найкращий тип публічного проксі. Ніколи не передевайте особисті дані через публічні проксі.

source: Invalid http response from socks proxy
de: Ungültige http Antwort von SOCKS-Proxy
ru: Неправильный http ответ от socks прокси
uk: Неправильна http відповідь від socks проксі

# OpeningConnectionFormat
source: {0} - opening connection
de: {0} - Öffnung Verbindung
ru: {0} - открывается соеденение
uk: {0} - відкривається з'єднання

# ProxyCheckingIfAliveFormat
source: {0} - checking if alive
de: {0} - Überprüfung, ob lebendig
ru: {0} - проверяется работоспособность
uk: {0} - визначається працездатність

# ProxyDeterminingLocationFormat
source: {0} - determining proxy location
de: {0} - Bestimmung Proxy-Standort
ru: {0} - определяется месторасположение
uk: {0} - визначається місцерозташування

# ProxyDeterminingProxyType
source: {0} - determining proxy type
de: {0} - Bestimmung Proxytyp
ru: {0} - определяется тип прокси
uk: {0} - визначається тип проксі

# ProxyDownloadingFormat
source: {0} - proxy downloading '{1}'
de: {0} - Proxy Download '{1}'
ru: {0} - прокси скачивает '{1}'
uk: {0} - проксі завантажує '{1}'

# ProxyGotFirstResponseFormat
source: {0} - got first response
de: {0} - bekam erste Antwort
ru: {0} - получен первый ответ
uk: {0} - отримана перша відповідь

source: Proxy property cannot be null.
de: Proxy-Eigenschaft kann nicht null sein.
ru: Proxy свойство не может равняться null
uk: Proxy властивість не може дорівнювати null

# ProxySearching
source: Searching proxies
de: Suchen Proxies
ru: Ищутся прокси
uk: Шукаються проксі

# SearchingInFolderFormat
source: Searching in folder '{0}'.
de: Suche im Verzeichnis '{0}'.
ru: Ищется в папке '{0}'
uk: Шукається в папці '{0}'

# Socks4Details
source: This proxy type is working on transport layer of TCP/IP protocol and supports v4 of Socks proxy
de: Diese Proxy-Typ ist auf Transportschicht TCP / IP-Protokoll arbeitet und unterstützt v4 von Socks-Proxy
ru: Этот тип прокси работает на транспортном уровне стека протоколов TCP/IP и поддерживает четвертую версию Socks прокси
uk: Цей тип проксі працює на транспортному рівні стека протоколів TCP/IP і підтримує четверту версію Socks проксі. Ніколи не передевайте особисті дані через публічні проксі.

# Socks5Details
source: This proxy type is working on transport layer of TCP/IP protocol and supports v5 of Socks proxy without authentication
de: Diese Proxy-Typ ist auf Transportschicht TCP / IP-Protokoll arbeitet und unterstützt v5 von Socks-Proxy ohne Authentifizierung
ru: Этот тип прокси работает на транспортном уровне стека протоколов TCP/IP и поддерживает пятую версию Socks прокси
uk: Цей тип проксі працює на транспортному рівні стека протоколів TCP/IP і підтримує п'яту версію Socks проксі. Ніколи не передевайте особисті дані через публічні проксі.

source: Synchronization task
de: Synchronisierungsaufgabe
ru: Синхронизационная задача
uk: Синхронізаційна задача

source: Too many redirects was requested by server
de: Zu viele Weiterleitungen wurde vom Server angefordert
ru: Слишком много перенаправлений запрошено сервером
uk: Надто багато перенаправлень запрошено сервером

source: Transparent
ru: Прозрачный
uk: Прозорий

# TransparentDetails
source: This proxy type doesn't hide your ip and proxy usage could be detected easily. It is the worst proxy type. Never transfer secure data with public proxy.
de: Diese Proxy-Typ nicht Ihre IP verstecken und Proxy-Nutzung könnte leicht erkannt werden. Es ist das Schlimmste Proxytyp. Nie transfer sichere Daten mit öffentlichen Proxy.
ru: Этот тип прокси не прячет ваш адрес и использование прокси может быть легко установлено. Это наихудший тип прокси. Никогда не передевайте личные данные через публичные прокси.
uk: Цей тип проксі не ховає Вашу адресу і використання проксі може бути легко встановлено. Це найгірший тип проксі. Ніколи не передевайте особисті дані через публічні проксі.

# UnableToResolveProxyHostnameFormat
source: Unable to resolve proxy hostname '{0}' to a valid IP address.
de: Kann Proxy Hostname '{0}' in eine gültige IP-Adresse aufzulösen.
ru: Невозможно определить валидный интернет адрес по хосту '{0}'.
uk: Неможливо визначити валідну інтернет адресу по хосту '{0}'.

source: Unchecked
de: Ungeprüft
ru: Не проверен
uk: Не перевірений

# UncheckedDetails
source: Ready for test
de: Bereit für Test
ru: Готов к проверке
uk: Готовий до перевірки

source: Unsupported http proxy type
de: Nicht unterstützte HTTP-Proxy-Typ
ru: Неподдерживаемый тип http прокси
uk: Цей тип http проксі не підтримується

source: Unsupported socks proxy type
de: Nicht unterstützte SOCKS-Proxy-Typ
ru: Неподдерживаемый тип socks прокси
uk: Цей тип socks проксі не підтримується

# WaitUntilProxyCheckerIsConfiguredFormat
source: {0} - wait until proxy checker is configured
de: {0} - warten Sie, bis Proxy-checker ist so konfiguriert
ru: {0} - ожидается настроенный метод проверки прокси
uk: {0} - очікується налаштований метод перевірки проксі

# WaitUntilProxyDetailsProviderConfiguredFormat
source: {0} - Wait until proxy details provider configured
de: {0} - Warten Sie, bis Proxyanbieter konfiguriert
ru: {0} - Ожидание поставщика деталей прокси
uk: {0} - Очікується постачальник деталей проксі
